[
  {
    "name": "Cognitive Restructuring",
    "description": "Challenge and reframe negative thought patterns by identifying cognitive distortions and replacing them with more balanced, realistic thoughts. Helps patients recognize automatic negative thoughts and develop alternative interpretations.",
    "modality": "CBT",
    "evidence_level": "strong"
  },
  {
    "name": "Behavioral Activation",
    "description": "Schedule and engage in positive, meaningful activities to improve mood and reduce avoidance behaviors. Patients identify valued activities and gradually increase engagement to combat depression and anxiety.",
    "modality": "CBT",
    "evidence_level": "strong"
  },
  {
    "name": "Exposure Therapy",
    "description": "Gradual, systematic exposure to anxiety-provoking situations or stimuli to reduce fear and avoidance. Uses hierarchy-based approach to help patients confront and overcome phobias and anxiety triggers.",
    "modality": "CBT",
    "evidence_level": "strong"
  },
  {
    "name": "Thought Records",
    "description": "Track and analyze automatic thoughts using structured worksheets. Patients document situations, emotions, automatic thoughts, evidence for/against thoughts, and alternative responses to develop cognitive flexibility.",
    "modality": "CBT",
    "evidence_level": "strong"
  },
  {
    "name": "Activity Scheduling",
    "description": "Plan structured daily activities to improve mood, productivity, and sense of accomplishment. Includes scheduling pleasant events, mastery activities, and breaking down tasks into manageable steps.",
    "modality": "CBT",
    "evidence_level": "strong"
  },
  {
    "name": "Mindfulness Practice",
    "description": "Cultivate present-moment awareness without judgment through meditation, breathing exercises, and mindful observation. Helps patients observe thoughts and emotions without being overwhelmed by them.",
    "modality": "DBT",
    "evidence_level": "strong"
  },
  {
    "name": "Distress Tolerance Skills",
    "description": "Learn strategies to manage crisis situations without making them worse. Includes TIPP skills, radical acceptance, distraction techniques, and self-soothing methods for intense emotional moments.",
    "modality": "DBT",
    "evidence_level": "strong"
  },
  {
    "name": "Emotion Regulation",
    "description": "Understand and manage intense emotions through identifying emotions, reducing vulnerability, increasing positive experiences, and applying opposite action. Builds emotional awareness and control.",
    "modality": "DBT",
    "evidence_level": "strong"
  },
  {
    "name": "Interpersonal Effectiveness",
    "description": "Assert needs and maintain healthy boundaries while preserving relationships. Uses DEAR MAN, GIVE, and FAST skills to navigate interpersonal conflicts and communicate effectively.",
    "modality": "DBT",
    "evidence_level": "strong"
  },
  {
    "name": "TIPP Skills",
    "description": "Crisis intervention using Temperature (cold water on face), Intense exercise, Paced breathing, and Paired muscle relaxation. Rapidly reduces emotional arousal during acute distress.",
    "modality": "DBT",
    "evidence_level": "strong"
  },
  {
    "name": "Progressive Muscle Relaxation",
    "description": "Systematically tense and relax muscle groups throughout the body to reduce physical tension and promote relaxation. Teaches body awareness and stress reduction through controlled muscle exercises.",
    "modality": "Relaxation",
    "evidence_level": "moderate"
  },
  {
    "name": "Deep Breathing Exercises",
    "description": "Diaphragmatic breathing exercises to activate the parasympathetic nervous system and reduce anxiety. Includes techniques like 4-7-8 breathing, box breathing, and belly breathing.",
    "modality": "Relaxation",
    "evidence_level": "moderate"
  },
  {
    "name": "Guided Imagery",
    "description": "Visualize calming scenes or positive experiences to reduce stress and anxiety. Uses multi-sensory imagination to create mental safe spaces and promote relaxation responses.",
    "modality": "Relaxation",
    "evidence_level": "moderate"
  },
  {
    "name": "Autogenic Training",
    "description": "Self-induced relaxation through verbal cues focused on heaviness, warmth, and calm. Patients learn phrases to promote physical relaxation and mental tranquility.",
    "modality": "Relaxation",
    "evidence_level": "moderate"
  },
  {
    "name": "Sleep Hygiene",
    "description": "Improve sleep quality through behavioral changes including consistent sleep schedule, bedroom environment optimization, limiting caffeine/screens, and establishing bedtime routines.",
    "modality": "Behavioral",
    "evidence_level": "strong"
  },
  {
    "name": "Assertiveness Training",
    "description": "Express needs, opinions, and boundaries effectively while respecting others. Learn to distinguish between passive, aggressive, and assertive communication styles and practice assertive responses.",
    "modality": "Behavioral",
    "evidence_level": "strong"
  },
  {
    "name": "Contingency Management",
    "description": "Use rewards and positive reinforcement to strengthen desired behaviors and reduce problematic behaviors. Involves identifying target behaviors, setting goals, and implementing reward systems.",
    "modality": "Behavioral",
    "evidence_level": "strong"
  },
  {
    "name": "Behavioral Experiments",
    "description": "Test beliefs and predictions through structured real-world experiments. Patients design experiments to gather evidence about their thoughts and assumptions, promoting cognitive change through experience.",
    "modality": "CBT",
    "evidence_level": "strong"
  },
  {
    "name": "Problem-Solving Training",
    "description": "Systematic approach to identifying problems, generating solutions, evaluating options, and implementing action plans. Teaches structured decision-making and coping skills for life challenges.",
    "modality": "Behavioral",
    "evidence_level": "strong"
  },
  {
    "name": "Values Clarification",
    "description": "Identify core personal values and align behaviors with what matters most. Helps patients make decisions consistent with their values and increase sense of meaning and purpose.",
    "modality": "ACT",
    "evidence_level": "strong"
  }
]
