{
  "session_id": "yt_VLDDUL3HBIg_20251216_214108",
  "video_id": "VLDDUL3HBIg",
  "url": "https://www.youtube.com/watch?v=VLDDUL3HBIg",
  "title": "Person-Centred Therapy Session - Full Example",
  "description": "This video features an actor who is happy for it to be used in this way. We contracted in detail about what we would do and how the footage might be used before recording. It's worth noting that the client's video is slightly out of sync with their audio at first - this isn't ideal, although it is a good example of the kinds of technological hurdles you have to navigate when working remotely!\n\nHaving spent a significant amount of time exploring person-centred theory, skills, and principles throughout this course, I thought the best way to conclude would be to put everything into practice and share a real example of what this can look like. While discussing these concepts in the abstract is valuable, I believe seeing them in action offers much deeper insight.\n\nI encourage you to approach this as though you are the client’s therapist. Reflect on what you notice and share—what responses would you feel inclined to offer if you were in the session? This isn’t about presenting a ‘perfect’ session or a ‘perfect’ therapist. From past experience, people may find that they would respond differently to what happens on the recording—and that’s completely fine. This is all part of the learning process!\n\nHow I do person-centred therapy is unique to me and shaped by my relationship with each client. The fact that this session involves an actor and is recorded also influences how it unfolds. I want to emphasise that I wouldn’t want anyone to want to be exactly like me—because the whole point of training and practicing as a person-centred therapist is to be yourself.\n\nAfter this video, there are two additional recordings, each approximately 45 minutes long, where I review the session and share my reflections, thoughts, and insights.\n\nTags: person-centred therapy, counselling demonstration, therapy session example, active listening skills, empathic counselling, authentic therapy session, counselling training, mental health, therapeutic techniques, client-centred approach, therapy reflection, counselling practice, therapy in action, person-centred counselling, real therapy session, counselling demonstration, therapeutic skills, mental health support, client-focused therapy, therapy training, reflective practice, counselling techniques, authentic counselling, therapy review, therapist training",
  "uploader": "Dave Hansen Person-Centred Therapist",
  "upload_date": "20250601",
  "duration": 3006,
  "duration_minutes": 50.1,
  "view_count": 1867,
  "like_count": 32,
  "channel": "Dave Hansen Person-Centred Therapist",
  "channel_url": "https://www.youtube.com/channel/UC83cbLB2P-eOuHiNOOymgiw",
  "tags": [
    "person-centred therapy",
    "counselling demonstration",
    "therapy session example",
    "empathic counselling",
    "authentic therapy session",
    "counselling training",
    "therapeutic techniques",
    "client-centred approach",
    "therapy reflection",
    "counselling practice",
    "therapy in action",
    "person-centred counselling",
    "real therapy session",
    "therapeutic skills",
    "client-focused therapy",
    "therapy training",
    "reflective practice",
    "counselling techniques",
    "authentic counselling",
    "therapy review",
    "therapist training"
  ],
  "categories": [
    "People & Blogs"
  ],
  "downloaded_at": "2025-12-16T21:41:54.855405"
}